backend/tests/load/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  processor: "./processor.js"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"

scenarios:
  - name: "Health Check"
    weight: 1
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  - name: "Search Fuel Stations"
    weight: 3
    flow:
      - get:
          url: "/api/stations/search?q=Shell"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/stations/search?q=Petron"
          expect:
            - statusCode: 200

  - name: "Routing Request"
    weight: 2
    flow:
      - function: "generateCoordinates"
      - get:
          url: "/api/route?start={{ startLat }},{{ startLng }}&end={{ endLat }},{{ endLng }}"
          expect:
            - statusCode: 200